                                              ---------------------The directory contains the following four scripts--------------------

   a.datasetgen.py --contains the method datapointgen(and associated helper functions duely described in comments) which takes number of sample points, number of data points and                                  sparsity as input and returns the labeled dataset with all labels being the integer multiple of sparsity.Sparsity(>1) is used to restrict the dataset to a less variety                       of labels(time period) so that the training is less cumbersome. As the waveform is generated by superimposing three basic waveforms, it will have the lcm of                                  individual time periods  as it's time period. The function "revlcm" serves this purpose.
   

   b.datsetsave.py --will create the dataset necessary for the training in the directory,given a choice of sample points,data points,sparsity. 

   c.training.py--   contains a function "dnn" which returns the model and the accuracy over test data and prints the model summary given the dataset,number ofsamplepoints,                                       sparsity and other network properties(epoch, batch size and number of layers) as input.The closest multiple of sparsity of the networks output is the prediction.                             Accuracy is the ratio of the number of instances,where the prediction matches the corresponding label of the test dataset,to the total number of instances in the                             testdata.  
   

   d.main.py--       this script with appropriate network features will intiate the training process.
 
 ***To run the code first the run datasetsave.py and then main.py.


                                                 --------------------------------------Result-----------------------------------------------

                     The code were run  for the following cases and the network yielded the following result:

                     set1 : dataset(number of sample points=500, number of data points =5000,sparsity=10) , network(number of layers=10, epochs=500,batch size=100)
                     output:
                            >accuracy --89.13%
                            >model history --          _________________________________________________________________
                                                        Layer (type)                 Output Shape              Param #   
                                                      =================================================================
                                                        dense (Dense)                (None, 500)               250500    
                                                       _________________________________________________________________
                                                        dense_1 (Dense)              (None, 500)               250500    
                                                       _________________________________________________________________
                                                        dense_2 (Dense)              (None, 450)               225450    
                                                       _________________________________________________________________
                                                        dense_3 (Dense)              (None, 400)               180400    
                                                       _________________________________________________________________
                                                        dense_4 (Dense)              (None, 350)               140350    
                                                       _________________________________________________________________
                                                        dense_5 (Dense)              (None, 300)               105300    
                                                       _________________________________________________________________
                                                        dense_6 (Dense)              (None, 250)               75250     
                                                       _________________________________________________________________
                                                        dense_7 (Dense)              (None, 200)               50200     
                                                       _________________________________________________________________
                                                        dense_8 (Dense)              (None, 150)               30150     
                                                       _________________________________________________________________
                                                        dense_9 (Dense)              (None, 100)               15100     
                                                       _________________________________________________________________
                                                        dense_10 (Dense)             (None, 50)                5050      
                                                       _________________________________________________________________
                                                        dense_11 (Dense)             (None, 1)                 51        
                                                       =================================================================
                                                        Total params: 1,328,301
                                                        Trainable params: 1,328,301
                                                        Non-trainable params: 0

                             

                        set2 : dataset(number of sample points=100, number of data points =5000,sparsity=5) , network(number of layers=10, epochs=500,batch size=100)
                        output: >accuracy --98.53
                                >model history --          _________________________________________________________________
                                                        Layer (type)                 Output Shape              Param #   
                                                       =================================================================
                                                        dense (Dense)                (None, 100)               10100     
                                                       _________________________________________________________________
                                                        dense_1 (Dense)              (None, 100)               10100     
                                                       _________________________________________________________________
                                                        dense_2 (Dense)              (None, 90)                9090      
                                                       _________________________________________________________________
                                                        dense_3 (Dense)              (None, 80)                7280      
                                                       _________________________________________________________________
                                                        dense_4 (Dense)              (None, 70)                5670      
                                                       _________________________________________________________________
                                                        dense_5 (Dense)              (None, 60)                4260      
                                                       _________________________________________________________________
                                                        dense_6 (Dense)              (None, 50)                3050      
                                                       _________________________________________________________________ 
                                                        dense_7 (Dense)              (None, 40)                2040      
                                                        _________________________________________________________________
                                                        dense_8 (Dense)              (None, 30)                1230      
                                                        _________________________________________________________________ 
                                                        dense_9 (Dense)              (None, 20)                620       
                                                        _________________________________________________________________
                                                        dense_10 (Dense)             (None, 10)                210       
                                                        _________________________________________________________________
                                                        dense_11 (Dense)             (None, 1)                 11        
                                                        =================================================================
                                                        Total params: 53,661
                                                        Trainable params: 53,661
                                                        Non-trainable params: 0

 



 









 
